{
  "_num_labels": 5,
  "add_cross_attention": false,
  "architectures": [
    "BertForSequenceClassification"
  ],
  "attention_probs_dropout_prob": 0.15,
  "bos_token_id": null,
  "classifier_dropout": null,
  "decoder_start_token_id": null,
  "directionality": "bidi",
  "dtype": "float32",
  "eos_token_id": null,
  "finetuning_task": null,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.3,
  "hidden_size": 768,
  "id2label": {
    "0": "Tumpukan Sampah",
    "1": "Jadwal Pengangkutan",
    "2": "Sampah Berukuran Besar",
    "3": "Fasilitas Rusak",
    "4": "Limbah Berbahaya",
    "5": "Administrasi",
    "6": "Bukan Sampah"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "is_decoder": false,
  "label2id": {
    "Administrasi": 5,
    "Bukan Sampah": 6,
    "Fasilitas Rusak": 3,
    "Jadwal Pengangkutan": 1,
    "Limbah Berbahaya": 4,
    "Sampah Berukuran Besar": 2,
    "Tumpukan Sampah": 0
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "bert",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "output_past": true,
  "pad_token_id": 0,
  "pooler_fc_size": 768,
  "pooler_num_attention_heads": 12,
  "pooler_num_fc_layers": 3,
  "pooler_size_per_head": 128,
  "pooler_type": "first_token_transform",
  "prefix": null,
  "pruned_heads": {},
  "task_specific_params": null,
  "tie_word_embeddings": true,
  "torchscript": false,
  "transformers_version": "5.0.0",
  "type_vocab_size": 2,
  "use_bfloat16": false,
  "use_cache": false,
  "vocab_size": 50000
}
